#  1)შექმენით სია, სადაც შეიტანთ თქვენი ოჯახის წევრების სახელებს. გამოიყენეთ indexing 
# და დაბეჭდეთ ყველას სახელი ცალ-ცალკე.

# list = ["qeti", "zaza",]

# print(list[1], list[0])

#-----------------------------------------------------

# 2) შექმენით სია, სადაც გექნებათ 1-იდან 10-ის ჩათვლით რიცხვები.
#  ჯერ გამოიტანეთ სიის პირველი, ხოლო შემდეგ ბოლო ელემენტი.

# number = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
# print(number)

# print(number[0], number[9])

#-----------------------------------------------------

#შექმენით სია, სადაც გექნებათ 10-იდან 20-ის ჩათვლით რიცხვები. გაიხსენეთ ის ფაქტი, რომ თქვენ შეგიძლიათ 
# უკვე შექმნილი სიის ელემენტების შეცვლა - შეცვალეთ სიის
#  ლუწ ინდექსებზე მყოფი ელემენტები და მათ მაგივრად დაწერეთ 1.


# number = [10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20 ]

# number[0] = 1
# number[2] = 1
# number[4] = 1
# number[6] = 1
# number[8] = 1
# number[10] = 1

# print(number)

#-------------------------------------------------------

#მომხმარებელს შეეკითხეთ სახელი, გვარი, ასაკი, საცხოვრებელი ადგილი და მეილი. 
#ყველა შეინახეთ ცვლადებში და შემდეგ ჩაამატეთ სიაში, საბოლოოდ კი დაბეჭდეთ ეს სია.


# user_name = str(input("what is you name: "))
# user_surname = str(input("what is you surname: "))
# user_age = int(input("what is you age: "))
# user_meil = str(input("what is you mail: "))
# user_haus = str(input("what is you haus: "))

# list = [user_name, user_surname, user_age, user_meil, user_haus]
# print(list)

#---------------------------------------------------------------

#ცვლადში შეინახეთ თქვენი გვარი. გამოიყენეთ indexing და მისი თითოეული ასო დაბეჭდეთ.

# surname = "chapidze"

# print(surname[0], surname[1], surname[2], surname[3], surname[4], surname[5])






