# მომხმარებელს შეეკითხეთ სწავლობს თუარა გოაში, თუ სწავლობს შეეკითხეთ ომელ ჯგუფშია, 
# თუ პასუხი იქნება ჯგუფი13 შეეკითეთ რომ არის თუ არა გაბრიელი მისი მენტორი,
# თუ პასუხი იქნება კი უთხარით რომ თქვენც აქ სწავლობთ და ნამდვილად გაბრიელია ორივეს მენტორი, 
# თუ პასუხი არიქნება გაბრიელი ყველა სხვა შემთხვევაში დაუბეჭდეთ რომ ის ტყუის და არარის სინამდვილეში ჯგუფ13-ში 😉


user_kitxva0 = input("swavlob goashi?: ")
print(user_kitxva0)



if user_kitxva0 == "yes" :
    group = input("romel jgupshi xar: ")
    if group == "13":
        kitxva = input("sheni mentori gabrielia: ")
        if kitxva == "yes":
            print("sheni namdvilad 13 jgupshi xar: ")
        
        else:
           print("shen ityuebi")